ATsupportum/src/Catalogs/ЭкземплярыПродуктов_ат/ЭкземплярыПродуктов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыПродуктов_ат</name>
  <owners>Catalog.ПоставкиПродуктов_ат</owners>
  <attributes>
    <name>КлиентАрендатор</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольСервераРазмещения</name>
    <type>
      <types>CatalogRef.РолиСерверов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверРазмещения</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПродукт</name>
    <type>
      <types>CatalogRef.Продукты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КомментарийВнутренний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>CatalogRef.ЭкземплярыПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРодительскогоЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>EnumRef.ТипыРодительскогоЭП_ат</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Enums/ТипыПродуктов_ат/ТипыПродуктов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПродуктов_ат</name>
  <enumValues>
    <name>Документация</name>
  </enumValues>
  <enumValues>
    <name>ДокументацияПП1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскаяЛицензия1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскаяЛицензияПП1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскийДоступMSSQLServer</name>
  </enumValues>
  <enumValues>
    <name>КлючUSB1С</name>
  </enumValues>
  <enumValues>
    <name>КлючUSBКонфигурации1С</name>
  </enumValues>
  <enumValues>
    <name>Книга</name>
  </enumValues>
  <enumValues>
    <name>Конфигурация1С</name>
  </enumValues>
  <enumValues>
    <name>Отчетность</name>
  </enumValues>
  <enumValues>
    <name>Платформа1С</name>
  </enumValues>
  <enumValues>
    <name>ПрочийПП</name>
  </enumValues>
  <enumValues>
    <name>ПрочийППMS</name>
  </enumValues>
  <enumValues>
    <name>Сервер_nix</name>
  </enumValues>
  <enumValues>
    <name>Сервер1С</name>
  </enumValues>
  <enumValues>
    <name>СерверIBMDB2</name>
  </enumValues>
  <enumValues>
    <name>СерверMSSQL</name>
  </enumValues>
  <enumValues>
    <name>СерверMSWindows</name>
  </enumValues>
  <enumValues>
    <name>СерверOracle</name>
  </enumValues>
  <enumValues>
    <name>СерверPostgreSQL</name>
  </enumValues>
  <enumValues>
    <name>СерверВеб</name>
  </enumValues>
  <enumValues>
    <name>УдаленныйДоступMSServer</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Enums/ТипыРолейСерверов_ат/ТипыРолейСерверов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРолейСерверов_ат</name>
  <enumValues>
    <name>РазмещениеОС</name>
  </enumValues>
  <enumValues>
    <name>СерверТерминалов</name>
  </enumValues>
  <enumValues>
    <name>Сервер1С</name>
  </enumValues>
  <enumValues>
    <name>СерверБД</name>
  </enumValues>
  <enumValues>
    <name>СерверФайловый</name>
  </enumValues>
  <enumValues>
    <name>СерверFTP</name>
  </enumValues>
  <enumValues>
    <name>СерверВеб</name>
  </enumValues>
  <enumValues>
    <name>СерверПрочий</name>
  </enumValues>
  <enumValues>
    <name>СерверАрхивныхДанных</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/ЭкземплярыПродуктов_ат/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Наименование = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С Тогда
		
		ПроверяемыеРеквизиты.Добавить("ТекущаяВерсия");
		
	Иначе
		
		КлиентАрендатор = Неопределено;
		
	КонецЕсли;
	
	Если НЕ УчетПродуктов_ат.ДоступнаМножественностьЭкземпляров(ТекущийПродукт.ТипПродукта) Тогда
		
		Количество = 1;
		
	КонецЕсли;
	
	ТипыРолейСерверов = УчетПродуктов_ат.ПолучитьТипыРолейСерверовПоТипуПродукта(ТекущийПродукт.ТипПродукта);
	
	Если ТипыРолейСерверов.Количество() = 0 Тогда
		
		//СерверРазмещения = Неопределено;
		РольСервераРазмещения = Неопределено;
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СерверРазмещения"));
		
	Иначе
		
		ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ);
		ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ);
		
		Если Отказ Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		//ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Платформа1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверMSSQL
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверPostgreSQL
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверOracle
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверIBMDB2 Тогда
		
		ПроверяемыеРеквизиты.Добавить("РольСервераРазмещения");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Ссылка.Пустая() И Ссылка.ТекущийПродукт.ТипПродукта <> ТекущийПродукт.ТипПродукта Тогда
		
		ИмяРегистра = УчетПродуктов_ат.ПолучитьИмяРегистраСпецификацииЭкземпляраПродукта(Ссылка.ТекущийПродукт.ТипПродукта);
		
		Если ИмяРегистра = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Попытка
			
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭкземплярПродукта.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
		Исключение
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПометкаУдаления Тогда
		
		ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ);
		ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ)
	
	ОграниченияПоКоличеству = УчетПродуктов_ат.ОпределитьДоступноеКоличествоЭкземпляров(Владелец, Ссылка);
	
	Если ОграниченияПоКоличеству.КоличествоОграничено
		 И ОграниченияПоКоличеству.ДоступноеКоличество < Количество Тогда
		
		Отказ = Истина;
		
		Сообщить("Количество экземпляров не может превышать количество в продукте." + Символы.ПС +
			"Максимальное доступное количество экземпляров: " + ОграниченияПоКоличеству.ДоступноеКоличество + "шт.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭкземплярыПродуктов_ат.Ссылка
		|ИЗ
		|	Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов_ат
		|ГДЕ
		|	ЭкземплярыПродуктов_ат.СерверРазмещения = &СерверРазмещения
		|	И ЭкземплярыПродуктов_ат.ТекущийПродукт.ТипПродукта = &ТипПродукта";
		
	Запрос.УстановитьПараметр("СерверРазмещения", СерверРазмещения);
	
	ТекстСообщения = "";
	
	////
	
	//????	//Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С Тогда
	//	
	//	Запрос.УстановитьПараметр("ТипПродукта", Перечисления.ТипыПродуктов_ат.Платформа1С);
	//	//ТекстСообщения = "На сервере " + СерверРазмещения + " отсутствует размещённый экземпляр технологической платформы 1С!";
	//	ТекстСообщения = "На " + РольСервераРазмещения + " отсутствует размещённый экземпляр технологической платформы 1С!";
	//	
	//КонецЕсли;
		
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		И РольСервераРазмещения.ВидРолиСервера.ТипРолиСервера = Перечисления.ТипыРолейСерверов_ат.Сервер1С Тогда
		
		Запрос.УстановитьПараметр("ТипПродукта", Перечисления.ТипыПродуктов_ат.Сервер1С);
		//ТекстСообщения = "На сервере " + СерверРазмещения + " отсутствует размещённый экземпляр сервера 1С!";
		ТекстСообщения = "На " + СерверРазмещения + " отсутствует размещённый экземпляр сервера 1С!";
		
	КонецЕсли;
	
	////
	
	Если ТекстСообщения = "" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить(); 
		
	КонецЕсли;	
	
КонецПроцедуры
